title: Detect Registry Query for RID Hijacking
id: 34567890-3456-7890-3456-789034567890
description: Detects attempts to query the registry for RID values indicating potential reconnaissance for RID hijacking.
status: experimental
author: SBT RENMARC
date: 2024/06/11
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        CommandLine|contains: "reg query"
        CommandLine|contains: "HKLM\\SAM\\SAM\\Domains\\Account\\Users"
    condition: selection
fields:
    - EventID
    - CommandLine
falsepositives:
    - Administrative scripts
level: medium
tags:
    - attack.persistence
    - attack.t1078.002