title: CrowdStrike Updater Tasklist Discovery Command
id: 73849562-9012-3456-7890-456273849562
status: experimental
description: HatefWiper may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on the system.
references:
    - blog
author: SBT Renmarc
date: 2024/07/22
tags:
    - attack.discovery
    - attack.t1057
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - CommandLine|contains: 'tasklist'
        - Image|endswith: '\tasklist.exe'
        - OriginalFileName: 'tasklist.exe'
    condition: selection
falsepositives:
    - Administrator and Administrative Scripts
level: informational
