title: Detect Data Patching in RID Hijacking
id: 56789012-5678-9012-5678-901256789012
description: Detects attempts to patch data in the registry for RID values indicating potential RID hijacking.
status: experimental
author: SBT RENMARC
date: 2024/06/11
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4656
        ProcessName: "C:\\Windows\\System32\\reg.exe"
        ObjectName: "\\REGISTRY\\MACHINE\\SAM\\SAM\\Domains\\Account\\Users\\*"
        Accesses:
            - "READ_CONTROL"
            - "Query key value"
            - "Set key value"
            - "Create sub-key"
    condition: selection
fields:
    - EventID
	- EventCode
    - ProcessName
    - ObjectName
    - Accesses
falsepositives:
    - Administrative scripts
level: high
tags:
    - attack.persistence
    - attack.t1078.002